Documents/РасписаниеАвтобусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>РасписаниеАвтобусов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Расписание</xr:Item>
				<xr:Item>InformationRegister.ЗанятостьСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Расписание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кондуктор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерМаршрута</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомерМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автобус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Транспорт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыезда</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПоездки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПриезда</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Занятость</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЗанятостьСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ВремяМаршрутаТранспорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ВремяМаршрутаТранспорта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомерМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/РасписаниеАвтобусов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ВызовРегистраДлительности(ДатаТек,ЭлементНомерМаршрута)Экспорт
	Отбор = Новый Структура;
	Отбор.Вставить("НомерМаршрута",ЭлементНомерМаршрута);
	Ресурсы = РегистрыСведений.ВремяМаршрутаТранспорта.ПолучитьПоследнее(ДатаТек,Отбор);
	Возврат Ресурсы.Длительность;
КонецФункции

&НаКлиенте
Процедура РасписаниеНомерМаршрутаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Расписание.ТекущиеДанные;
	ТекущиеДанные.ВремяПоездки = ВызовРегистраДлительности(ТекущаяДата(), ТекущиеДанные.НомерМаршрута); 
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеВремяВыездаПриИзменении(Элемент)
ТекущиеДанные = Элементы.Расписание.ТекущиеДанные;
     РассчетВремени();
            ТекущиеДанные.ВремяПриезда = ТекущиеДанные.ВремяВыезда + (ТекущиеДанные.ВремяПоездки * 3600);
КонецПроцедуры

&НаКлиенте
Процедура РассчетВремени()
		ТекущиеДанные = Элементы.Расписание.ТекущиеДанные;
 ТекущиеДанные.ВремяПриезда = ТекущиеДанные.ВремяВыезда + (ТекущиеДанные.ВремяПоездки * 3600);
	КонецПроцедуры

&НаКлиенте
	Процедура РасписаниеВремяПриездаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Расписание.ТекущиеДанные;			
       ТекущиеДанные.ВремяПриезда = ТекущиеДанные.ВремяВыезда + (ТекущиеДанные.ВремяПоездки * 3600);
	РассчетВремени();
	КонецПроцедуры

&НаКлиенте
	Процедура РасписаниеВремяПоездкиПриИзменении(Элемент)
	РассчетВремени();	
	КонецПроцедуры
